#include<stdio.h>
#include<string.h>
#include<time.h>

main()
{
printf ("\033[0d\033[2J");//Очищение экрана терминала.

int portnum;   //port number.
int baudrate; //speed of port.
int bits;    //stop bits.

//Обьявляем 32-бита.===============================================================================

int x1, y1, z1, u1;
int x2, y2, z2, u2;
int x3, y3, z3, u3;
int x4, y4, z4, u4;
int x5, y5, z5, u5;
int x6, y6, z6, u6;
int x7, y7, z7, u7;
int x8, y8, z8, u8;

int x9, y9, z9, u9;
int x10, y10, z10, u10;
int x11, y11, z11, u11;
int x12, y12, z12, u12;
int x13, y13, z13, u13;
int x14, y14, z14, u14;
int x15, y15, z15, u15;
int x16, y16, z16, u16;

int x17, y17, z17, u17;
int x18, y18, z18, u18;
int x19, y19, z19, u19;
int x20, y20, z20, u20;
int x21, y21, z21, u21;
int x22, y22, z22, u22;
int x23, y23, z23, u23;
int x24, y24, z24, u24;

int x25, y25, z25, u25;
int x26, y26, z26, u26;
int x27, y27, z27, u27;
int x28, y28, z28, u28;
int x29, y29, z29, u29;
int x30, y30, z30, u30;
int x31, y31, z31, u31;
int x32, y32, z32, u32;

//Обнуляем все 32-бита.===============================================================================

//входящие 8-bit часть "I".

x1=y1=z1=u1=0;
x2=y2=z2=u2=0;
x3=y3=z3=u3=0;
x4=y4=z4=u4=0;
x5=y5=z5=u5=0;
x6=y6=z6=u6=0;
x7=y7=z7=u7=0;
x8=y8=z8=u8=0;

//входящие 8-bit часть "II".

x9=y9=z9=u9=0;
x10=y10=z10=u10=0;
x11=y11=z11=u11=0;
x12=y12=z12=u12=0;
x13=y13=z13=u13=0;
x14=y14=z14=u14=0;
x15=y15=z15=u15=0;
x16=y16=z16=u16=0;

//входящие 8-bit часть "III".

x17=y17=z17=u17=0;
x18=y18=z18=u18=0;
x19=y19=z19=u19=0;
x20=y20=z20=u20=0;
x21=y21=z21=u21=0;
x22=y22=z22=u22=0;
x23=y23=z23=u23=0;
x24=y24=z24=u24=0;

//входящие 8-bit часть "IV".

x25=y25=z25=u25=0;
x26=y26=z26=u26=0;
x27=y27=z27=u27=0;
x28=y28=z28=u28=0;
x29=y29=z29=u29=0;
x30=y30=z30=u30=0;
x31=y31=z31=u31=0;
x32=y32=z32=u32=0;

//что то на подобие "UI".===============================================================================


printf("o===============================================o==============================================o\n");
printf("|                                           > RS232 <                                          |\n");
printf("o----------------------------------------------------------------------------------------------o\n");
printf("|                                                                                              |\n");
printf("|         %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d         |\n", x1, y1, z1, u1, x2, y2, z2, u2, x3, y3, z3, u3, x4, y4, z4, u4);
printf("|                                                                                              |\n");
printf("|         %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d         |\n", x5, y5, z5, u5, x6, y6, z6, u6, x7, y7, z7, u7, x8, y8, z8, u8);
printf("|                                                                                              |\n");
printf("|         %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d         |\n", x9, y9, z9, u9, x10, y10, z10, u10, x11, y11, z11, u11, x12, y12, z12, u12);
printf("|                                                                                              |\n");
printf("|         %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d         |\n", x13, y13, z13, u13, x14, y14, z14, u14, x15, y15, z15, u15, x16, y16, z16, u16);
printf("|                                                                                              |\n");
printf("|         %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d         |\n", x17, y17, z17, u17, x18, y18, z18, u18, x19, y19, z19, u19, x20, y20, z20, u20);
printf("|                                                                                              |\n");
printf("|         %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d         |\n", x21, y21, z21, u21, x22, y22, z22, u22, x23, y23, z23, u23, x24, y24, z24, u24);
printf("|                                                                                              |\n");
printf("|         %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d         |\n", x25, y25, z25, u25, x26, y26, z26, u26, x27, y27, z27, u27, x28, y28, z28, u28);
printf("|                                                                                              |\n");
printf("|         %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d    %d         |\n", x29, y29, z29, u29, x30, y30, z30, u30, x31, y31, z31, u31, x32, y32, z32, u32 );
printf("|                                                                                              |\n");
printf("o----------------------------------------------------------------------------------------------o\n");
printf("|                                          Sucсessfly!                                         |\n");
printf("o===============================================o==============================================o\n");

while (1);
{
printf("                              EXIT                        |\n");
return (0);
}
}
