/*-----------------------------------Библиотеки--------------------------------------------------*/

#include <stdio.h>                        // стандартная i/o lib.
#include <termios.h>                      // перехват управления POSIX терминала
#include <ncurses.h>                      // графика ncurses.

/*-------------------------------------------------------------------------------------*/



/*--------------------------------------MAIN-----------------------------------------------*/

int main(int argc, char *argv[])          //
{
printf("\033[0d\33[2J");  // очищение экрана терминала.

/*-------------------------------------------------------------------------------------*/



/*-------------------------------------------------------------------------------------*/

initscr();                               // активируем текущий режим curses.
refresh();

/*-------------------------------------COLORS------------------------------------------------*/

raw();
start_color();                           // включаем режим цвета на background.
use_default_colors();

init_pair(1,COLOR_BLACK, COLOR_GREEN);   // создаем слой цветов на вывод.
init_pair(2,COLOR_CYAN, COLOR_WHITE);
init_pair(3,COLOR_BLACK, COLOR_WHITE);
init_pair(4,COLOR_WHITE, COLOR_BLACK);

/*-------------------------------------------------------------------------------------*/



/*-------------------------------------------------------------------------------------*/

attron(COLOR_PAIR(1));                 // активируем режим слоя цветов.
mvprintw(2, 3, "RBVT-14");             // вывод строки.
attroff(COLOR_PAIR(1));                // выключаем режим слоя цветов.

 addch('$');                           // добавляем вывод последовательно.
 move(22,10);                          //

int derp = 4;

attron(A_BOLD | A_UNDERLINE);      // включаем режим выделения текста.
mvprintw(2, 11, "TEST232");            // выводим текст с параметрами местоположения.
attroff(A_BOLD | A_UNDERLINE);     // выключаем режим выделения текста.

/*-------------------------------------------------------------------------------------*/



/*-------------------------------------------------------------------------------------*/

/* mvprintw(16, 4, "Baud :%s\n", );    // вывод установленной скорости. */
/* mvprintw(17, 4, "Port :%s\n", );    // вывод выбранного порта tty.   */

/*-------------------------------------------------------------------------------------*/

attron(COLOR_PAIR(2));
mvprintw(18, 3, "Date : %s\n", __DATE__ );  // вывод даты из системы.
attroff(COLOR_PAIR(2)); 

attron(COLOR_PAIR(2));
mvprintw(19, 3, "Time : %s\n", __TIME__ );  // вывод времени из системы.
attroff(COLOR_PAIR(2));

attron(COLOR_PAIR(2));
mvprintw(19, 18, ":00"); // костыль.
attroff(COLOR_PAIR(2));

/*-------------------------------------------------------------------------------------*/


/*-------------------------------------------------------------------------------------*/
start_color();                           // включаем режим цвета на background.
mvaddch(2, 18,':');       // ввод для консоли.

refresh();
getch();                  // ожидание user ввода.
endwin();                 // завершение текущего режима curses.

return 0;
}


